; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v5 ?v7)
             (pred_6 ?v9 ?v13)
             (pred_12 ?v5 ?v13)
             (pred_4 ?v8 ?v5 )
	     (pred_5 ?v5)
             (pred_1 ?v12)
             (pred_9 ?v9)
             (pred_3 ?v13)
             (pred_10 ?v5)
             (pred_8 ?v9)
             (pred_2 ?v5)
             (pred_11 ))



(:action op_1
:parameters (?v4 ?v3 ?v1 ?v6)
:precondition (and (pred_1 ?v4) (pred_1 ?v3) (pred_9 ?v1) (pred_3 ?v6)
          (pred_7 ?v4 ?v3) (pred_6 ?v1 ?v6)
                   (pred_12 ?v3 ?v6) (pred_5 ?v4) 
                   (pred_10 ?v3) (pred_8 ?v1))
:effect (and  (pred_2 ?v3) (not (pred_10 ?v3))))


(:action op_2
:parameters (?v4 ?v10)
:precondition (and (pred_1 ?v4) (pred_1 ?v10)
               (pred_5 ?v4) (pred_7 ?v4 ?v10) (pred_2 ?v10))
:effect (and (pred_5 ?v10) (not (pred_5 ?v4))))

(:action op_4
:parameters (?v4 ?v1)
:precondition (and (pred_1 ?v4) (pred_9 ?v1) 
                  (pred_5 ?v4) (pred_4 ?v1 ?v4) (pred_11 ))
:effect (and (pred_8 ?v1)
   (not (pred_4 ?v1 ?v4)) (not (pred_11 ))))


(:action op_5
:parameters (?v4 ?v11 ?v2)
:precondition (and (pred_1 ?v4) (pred_9 ?v11) (pred_9 ?v2)
                  (pred_5 ?v4) (pred_8 ?v2) (pred_4 ?v11 ?v4))
:effect (and (pred_8 ?v11) (pred_4 ?v2 ?v4)
        (not (pred_8 ?v2)) (not (pred_4 ?v11 ?v4))))

(:action op_3
:parameters (?v4 ?v1)
:precondition (and (pred_1 ?v4) (pred_9 ?v1) 
                  (pred_5 ?v4) (pred_8 ?v1))
:effect (and (pred_11 ) (pred_4 ?v1 ?v4) (not (pred_8 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_01 obj_19 obj_14 obj_15 obj_06 obj_09 obj_17 obj_10 obj_20 obj_02 obj_05 obj_08 obj_16 obj_13 obj_03
    obj_21 obj_07 obj_04
    obj_22 obj_12 obj_11
    )

    (:init
       (pred_11)

       (pred_1 obj_18)
       (pred_1 obj_01)
       (pred_1 obj_19)
       (pred_1 obj_14)
       (pred_1 obj_15)
       (pred_1 obj_06)
       (pred_1 obj_09)
       (pred_1 obj_17)
       (pred_1 obj_10)
       (pred_1 obj_20)
       (pred_1 obj_02)
       (pred_1 obj_05)
       (pred_1 obj_08)
       (pred_1 obj_16)
       (pred_1 obj_13)
       (pred_1 obj_03)
       (pred_3 obj_21)
       (pred_3 obj_07)
       (pred_3 obj_04)
       (pred_9 obj_22)
       (pred_9 obj_12)
       (pred_9 obj_11)

       (pred_7 obj_18 obj_15)
       (pred_7 obj_18 obj_01)
       (pred_7 obj_01 obj_06)
       (pred_7 obj_01 obj_19)
       (pred_7 obj_01 obj_18)
       (pred_7 obj_19 obj_09)
       (pred_7 obj_19 obj_14)
       (pred_7 obj_19 obj_01)
       (pred_7 obj_14 obj_17)
       (pred_7 obj_14 obj_19)
       (pred_7 obj_15 obj_10)
       (pred_7 obj_15 obj_06)
       (pred_7 obj_15 obj_18)
       (pred_7 obj_06 obj_20)
       (pred_7 obj_06 obj_09)
       (pred_7 obj_06 obj_01)
       (pred_7 obj_06 obj_15)
       (pred_7 obj_09 obj_02)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_09 obj_19)
       (pred_7 obj_09 obj_06)
       (pred_7 obj_17 obj_05)
       (pred_7 obj_17 obj_14)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_10 obj_15)
       (pred_7 obj_20 obj_16)
       (pred_7 obj_20 obj_02)
       (pred_7 obj_20 obj_06)
       (pred_7 obj_20 obj_10)
       (pred_7 obj_02 obj_13)
       (pred_7 obj_02 obj_05)
       (pred_7 obj_02 obj_09)
       (pred_7 obj_02 obj_20)
       (pred_7 obj_05 obj_03)
       (pred_7 obj_05 obj_17)
       (pred_7 obj_05 obj_02)
       (pred_7 obj_08 obj_16)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_16 obj_13)
       (pred_7 obj_16 obj_20)
       (pred_7 obj_16 obj_08)
       (pred_7 obj_13 obj_03)
       (pred_7 obj_13 obj_02)
       (pred_7 obj_13 obj_16)
       (pred_7 obj_03 obj_05)
       (pred_7 obj_03 obj_13)
       (pred_10 obj_01)
       (pred_10 obj_13)
       (pred_10 obj_18)
       (pred_12  obj_01 obj_21)
       (pred_12  obj_13 obj_07)
       (pred_12  obj_18 obj_04)
       (pred_2 obj_19)
       (pred_2 obj_14)
       (pred_2 obj_15)
       (pred_2 obj_06)
       (pred_2 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_2 obj_02)
       (pred_2 obj_05)
       (pred_2 obj_08)
       (pred_2 obj_16)
       (pred_2 obj_03)

       (pred_6  obj_22 obj_21)
       (pred_6  obj_12 obj_07)
       (pred_6  obj_11 obj_04)
       (pred_4 obj_22 obj_03)
       (pred_4 obj_12 obj_06)
       (pred_4 obj_11 obj_08)
       (pred_5 obj_20)
    )

    (:goal (and
       (pred_4 obj_11 obj_03)
    ))
(:constraints
  (always (not (pred_5 obj_10)))
)
)

; plan
1. (op_2 obj_20 obj_16)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_16)
   goals met: 0 of 1
2. (op_2 obj_16 obj_08)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_08)
   goals met: 0 of 1
3. (op_4 obj_08 obj_11)
   deleted: (pred_4 obj_11 obj_08) (pred_11)
   added: (pred_8 obj_11)
   goals met: 0 of 1
4. (op_2 obj_08 obj_16)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_16)
   goals met: 0 of 1
5. (op_2 obj_16 obj_20)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_20)
   goals met: 0 of 1
6. (op_2 obj_20 obj_02)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_02)
   goals met: 0 of 1
7. (op_2 obj_02 obj_05)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_05)
   goals met: 0 of 1
8. (op_2 obj_05 obj_03)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_03)
   goals met: 0 of 1
9. (op_5 obj_03 obj_22 obj_11)
   deleted: (pred_8 obj_11) (pred_4 obj_22 obj_03)
   added: (pred_8 obj_22) (pred_4 obj_11 obj_03)
   goals met: 1 of 1
